[
    {
        "estate_title": "Spacious Family Home in Suburbia",
        "id": 1,
        "segment_name": "single_family_homes",
        "description": "This beautiful single-family home boasts 4 bedrooms, 2 bathrooms, and a large backyard, making it perfect for families seeking comfort and space. Nestled in the serene suburbs, this property offers a peaceful retreat from the hustle and bustle of city life. With ample natural light and modern amenities, including a spacious living room and fully equipped kitchen, this home is ideal for both relaxation and entertaining guests. Enjoy outdoor gatherings or simply unwind in the privacy of your backyard oasis. Conveniently located near schools, parks, and shopping centers, this home offers the perfect blend of tranquility and convenience.",
        "price": 350000,
        "status": "Sale",
        "area": "2500 sq ft",
        "location": "Suburbia, City",
        "facilities": ["living room", "kitchen", "backyard"],
        "image_url": "https://assets.lbmjournal.com/uploads/2019/11/new-single-family-home.jpg",
        "view_property_button": "<button>View Property</button>"

     },
    
      {
        "estate_title": "Modern Townhouse in Downtown",
        "id": 2,
        "segment_name": "townhouses",
        "description": "Discover urban living at its finest with this modern townhouse located in the heart of downtown. Featuring 3 bedrooms, 2.5 bathrooms, and a rooftop terrace with stunning city views, this property offers contemporary elegance and convenience. The open-plan layout, stylish kitchen, and spacious living area create a welcoming atmosphere for both relaxation and entertainment. Step outside onto the rooftop terrace to enjoy alfresco dining or simply admire the city skyline. With easy access to restaurants, shops, and cultural attractions, this townhouse provides the perfect combination of luxury and city living.",
        "price": 450000,
        "status": "Sale",
        "area": "1800 sq ft",
        "location": "Downtown, City",
        "facilities": ["living room", "kitchen", "rooftop terrace"],
        "image_url": "https://media.istockphoto.com/id/1393537665/photo/modern-townhouse-design.webp?b=1&s=170667a&w=0&k=20&c=vlUsVGOI_lm_cZUwwHZWeBL5RRfxYHExELD5vOGTwV8=",
        "view_property_button": "<button>View Property</button>"
      },
   
      {
        "estate_title": "Luxury Apartment with City Views",
        "id": 3,
        "segment_name": "apartments",
        "description": "Indulge in luxury living with this exquisite apartment offering breathtaking city views. Boasting 2 bedrooms, 2 bathrooms, and a balcony, this residence provides a sophisticated urban retreat. The spacious living room, elegant kitchen, and modern amenities ensure both comfort and style. Wake up to panoramic city vistas from your private balcony or unwind in the building's communal spaces, including a fitness center and lounge area. Situated in the vibrant City Center district, this apartment offers easy access to dining, shopping, and entertainment options, allowing you to experience the best of city living.",
        "price": 2500,
        "status": "Rent",
        "area": "1200 sq ft",
        "location": "City Center",
        "facilities": ["living room", "kitchen", "balcony"],
        "image_url": "https://images1.apartments.com/i2/_xB1g0MxMfdBgg-gASrdzhVLw89XKxIy5poKqvrXK0g/117/lofts-at-waikoloa-waikoloa-hi-building-photo.jpg?p=1",
        "view_property_button": "<button>View Property</button>"
      },

      {
        "estate_title": "Student Residence Near University Campus",
        "id": 4,
        "segment_name": "student_housing",
        "description": "Experience convenient student living with this furnished residence located near the university campus. Offering shared amenities such as study rooms and a fitness center, this accommodation provides a conducive environment for academic success. Each room comes equipped with essential furnishings, providing students with comfort and convenience. With its proximity to campus facilities and public transportation, this residence offers easy access to academic resources and off-campus activities. Whether studying or socializing, this student housing ensures a fulfilling college experience in a supportive community.",
        "price": 800,
        "status": "Rent",
        "area": "500 sq ft (per room)",
        "location": "University District",
        "facilities": ["bedroom", "study room", "fitness center"],
        "image_url": "https://studenthousingbusiness.com/wp-content/uploads/2023/05/Interior-Design.jpg",
        "view_property_button": "<button>View Property</button>"
      },
   
      {
        "estate_title": "Retirement Community with Care Services",
        "id": 5,
        "segment_name": "senior_living_communities",
        "description": "Embrace retirement living in this vibrant senior community offering independent and assisted living options. With onsite medical care, recreational activities, and spacious accommodations, residents can enjoy a fulfilling lifestyle in a supportive environment. The studio apartments feature modern amenities and thoughtful design, ensuring comfort and convenience for seniors. Engage in social activities, pursue hobbies, or simply relax in the communal areas designed for leisure and entertainment. Located in the serene Senior Community Area, this retirement community provides a tranquil setting for enjoying the golden years with peace of mind.",
        "price": 4000,
        "status": "Rent",
        "area": "800 sq ft (studio)",
        "location": "Senior Community Area",
        "facilities": ["bedroom", "bathroom", "recreational center"],
        "image_url": "https://www.storypoint.com/wp-content/uploads/2020/08/storypoint-community-exterior.jpg",
        "view_property_button": "<button>View Property</button>"
      },
    
      {
        "estate_title": "Beachfront Villa for Vacation Rental",
        "id": 6,
        "segment_name": "vacation_rentals",
        "description": "Escape to paradise with this luxurious beachfront villa, offering a private pool and direct access to the sandy shores. With spacious accommodations and breathtaking ocean views, this property provides the ultimate vacation getaway. The villa features multiple bedrooms, each with its own en-suite bathroom, ensuring privacy and comfort for all guests. Relax in the outdoor living area, take a dip in the pool, or stroll along the pristine beach just steps away from your doorstep. Whether you're seeking relaxation or adventure, this beachfront villa offers an unforgettable experience in a tropical paradise.",
        "price": 5000,
        "status": "Rent",
        "area": "3000 sq ft",
        "location": "Beachfront",
        "facilities": ["bedroom", "private pool", "beach access"],
        "image_url": "https://alekonakauai.com/wp-content/uploads/2022/05/alekona-kauai-vacation-rentals-1.jpg",
        "view_property_button": "<button>View Property</button>"
      }
]